Revit 2027 API
GroupLoadOptions Properties
The GroupLoadOptions type exposes the following members.
Properties
Name | Description
IncludeAttachedDetails |  True if attached detail groups should be included, false otherwise. The default value is true.
IncludeGrids |  True if grids should be brought in from the input file, false otherwise. The default value is false.
IncludeLevels |  True if levels should be brought in from the input file, false otherwise. The default value is false.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ReplaceDuplicatedGroups |  If there are groups with the same names in source and destination documents set this property to true to replace existing groups, otherwise the operation will be canceled. The default value is false.
Top
See Also
Reference
GroupLoadOptions Class
Autodesk.Revit.DB Namespace